
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>编程语言分类 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../http/000http.html">
            
                <a href="../http/000http.html">
            
                    
                    HTTP
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../http/002response_status_codes.html">
            
                <a href="../http/002response_status_codes.html">
            
                    
                    HTTP响应状态码
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../ios/000ios.html">
            
                <a href="../ios/000ios.html">
            
                    
                    iOS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../ios/001oc.html">
            
                <a href="../ios/001oc.html">
            
                    
                    iOS
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    Other
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="language_type.html">
            
                <a href="language_type.html">
            
                    
                    编程语言分类
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >编程语言分类</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5206;&#x7C7B;">&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5206;&#x7C7B;</h1>
<hr>
<h3 id="&#x6839;&#x636E;&#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#x533A;&#x5206;">&#x6839;&#x636E;&#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#x533A;&#x5206;</h3>
<h5 id="1&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#xFF08;compiled-language&#xFF09;">1.&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#xFF08;Compiled language&#xFF09;</h5>
<p>&#x9700;&#x901A;&#x8FC7;&#x7F16;&#x8BD1;&#x5668;&#xFF08;compiler&#xFF09;&#x5C06;&#x6E90;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x6267;&#x884C;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x4E00;&#x822C;&#x9700;&#x7ECF;&#x8FC7;&#x7F16;&#x8BD1;&#xFF08;compile&#xFF09;&#x3001;&#x94FE;&#x63A5;&#xFF08;linker&#xFF09;&#x8FD9;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x7F16;&#x8BD1;&#x628A;&#x6E90;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x94FE;&#x63A5;&#x628A;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x673A;&#x5668;&#x7801;&#x548C;&#x4F9D;&#x8D56;&#x5E93;&#x4E32;&#x8FDE;&#x8D77;&#x6765;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x53EF;&#x4EE5;&#x662F;&#x7F16;&#x8BD1;&#x5F0F;&#xFF0C;&#x6216;&#x76F4;&#x8BD1;&#x5F0F;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4EC5;&#x4E0E;&#x7A0B;&#x5E8F;&#x7684;&#x5E94;&#x7528;&#x6709;&#x5173;&#x3002;
&#x4F18;&#x70B9;&#xFF1A;&#x7F16;&#x8BD1;&#x5668;&#x4E00;&#x822C;&#x4F1A;&#x6709;&#x9884;&#x7F16;&#x8BD1;&#x7684;&#x8FC7;&#x7A0B;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x53EA;&#x505A;&#x4E00;&#x6B21;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x6548;&#x7387;&#x9AD8;&#x3002;&#x53EF;&#x4EE5;&#x8131;&#x79BB;&#x8BED;&#x8A00;&#x73AF;&#x5883;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x3002;
&#x7F3A;&#x70B9;&#xFF1A;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#x5982;&#x679C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5C31;&#x9700;&#x8981;&#x6574;&#x4E2A;&#x6A21;&#x5757;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x3002;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x6839;&#x636E;&#x5BF9;&#x5E94;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x751F;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x79FB;&#x690D;&#x5C31;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x7F16;&#x8BD1;&#x4E0D;&#x540C;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;C&#x3001;C++&#x3001;Pascal&#x3001;Objective-C&#x3001;Swift&#x3002;</p>
<h5 id="2&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF08;interpreted-language&#xFF09;">2.&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF08;Interpreted language&#xFF09;</h5>
<p>&#x5229;&#x7528;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x671F;&#xFF0C;&#x52A8;&#x6001;&#x5C06;&#x4EE3;&#x7801;&#x9010;&#x53E5;&#x89E3;&#x91CA;&#xFF08;interpret&#xFF09;&#x4E3A;&#x673A;&#x5668;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x662F;&#x8FD0;&#x884C;&#x9884;&#x5148;&#x7F16;&#x8BD1;&#x4E3A;&#x673A;&#x5668;&#x4EE3;&#x7801;&#x7684;&#x7684;&#x5B50;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x8FD0;&#x884C;&#x3002;
&#x4F18;&#x70B9;&#xFF1A;&#x6709;&#x826F;&#x597D;&#x7684;&#x5E73;&#x53F0;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x73AF;&#x5883;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x5B89;&#x88C5;&#x4E86;&#x89E3;&#x91CA;&#x5668;&#xFF08;&#x865A;&#x62DF;&#x673A;&#xFF09;&#x3002;&#x7075;&#x6D3B;&#xFF0C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x4FEE;&#x6539;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x90E8;&#x7F72;&#xFF0C;&#x4E0D;&#x7528;&#x505C;&#x673A;&#x7EF4;&#x62A4;&#x3002;
&#x7F3A;&#x70B9;&#xFF1A;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x89E3;&#x91CA;&#x4E00;&#x904D;&#xFF0C;&#x6027;&#x80FD;&#x4E0A;&#x4E0D;&#x5982;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;JavaScript&#x3001;Python&#x3001;Erlang&#x3001;PHP&#x3001;Perl&#x3001;Ruby&#x3002;</p>
<h5 id="3&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#xFF08;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#xFF09;">3.&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#xFF08;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#xFF09;</h5>
<p>&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x4E00;&#x53E5;&#x4E00;&#x53E5;&#x7F16;&#x8BD1;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x7FFB;&#x8BD1;&#x8FC7;&#x7684;&#x4EE3;&#x7801;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#x4EE5;&#x964D;&#x4F4E;&#x6027;&#x80FD;&#x635F;&#x8017;&#x3002;&#x76F8;&#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x7684;&#x9759;&#x6001;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5EF6;&#x8FDF;&#x7ED1;&#x5B9A;&#x5E76;&#x589E;&#x5F3A;&#x5B89;&#x5168;&#x6027;&#x3002;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x4E00;&#x662F;&#x5B57;&#x8282;&#x7801;&#x7FFB;&#x8BD1;&#xFF0C;&#x4E8C;&#x662F;&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#x7FFB;&#x8BD1;&#x3002;&#x5FAE;&#x8F6F;&#x7684;.NET Framework&#xFF0C;&#x8FD8;&#x6709;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;Java&#x5B9E;&#x73B0;&#xFF0C;&#x90FD;&#x4F9D;&#x8D56;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x4EE5;&#x63D0;&#x4F9B;&#x9AD8;&#x901F;&#x7684;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x3002;
JAVA&#x5C06;&#x6E90;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x751F;&#x6210;&#x5B57;&#x8282;&#x7801;&#xFF08;.class &#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x518D;&#x901A;&#x8FC7;JVM&#xFF08;java &#x865A;&#x62DF;&#x673A;&#xFF09;&#x8FD0;&#x884C;&#x751F;&#x6210;&#x673A;&#x5668;&#x6307;&#x4EE4;&#xFF0C;&#x7531;&#x673A;&#x5668;&#x8FD0;&#x884C;&#x673A;&#x5668;&#x7801;&#xFF08;&#x89E3;&#x91CA;&#x578B;&#xFF09;&#x3002;JVM&#x6709;&#x4E00;&#x79CD;JIT&#xFF08;Just in time&#xFF09;&#x673A;&#x5236;&#xFF0C;&#x80FD;&#x591F;&#x5C06;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x89E3;&#x91CA;&#x7FFB;&#x8BD1;&#x7684;&#x5E38;&#x7528;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x4FDD;&#x5B58;&#x3002;&#x4E0B;&#x6B21;&#x4E0D;&#x9700;&#x8981;&#x89E3;&#x91CA;&#xFF0C;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x5373;&#x53EF;&#xFF08;&#x7F16;&#x8BD1;&#x578B;&#xFF09;&#x3002;
C#&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x7F16;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x7801;&#x800C;&#x662F;&#x4E2D;&#x95F4;&#x4EE3;&#x7801;&#xFF08;Microsoft Intermediate Language&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x5E93;&#xFF08;.NET Framework&#x865A;&#x62DF;&#x673A;&#xFF09;&#x6267;&#x884C;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x65F6;&#xFF0C;.Net Framework&#x5C06;&#x4E2D;&#x95F4;&#x4EE3;&#x7801;&#x7FFB;&#x8BD1;&#x6210;&#x4E3A;&#x4E8C;&#x8FDB;&#x5236;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5B83;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x8FD0;&#x884C;&#x3002;&#x6700;&#x7EC8;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x4EE3;&#x7801;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#xFF08;Buffer&#xFF09;&#x4E2D;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x65E6;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4F1A;&#x8C03;&#x7528;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x6837;&#x5982;&#x679C;&#x4E00;&#x4E2A;.Net&#x7A0B;&#x5E8F;&#x7B2C;&#x4E8C;&#x6B21;&#x88AB;&#x8FD0;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x79CD;&#x7FFB;&#x8BD1;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7B2C;&#x4E8C;&#x6B21;&#xFF0C;&#x901F;&#x5EA6;&#x660E;&#x663E;&#x52A0;&#x5FEB;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;Java&#xFF0C;C#&#x3002;</p>
<hr>
<h3 id="&#x6839;&#x636E;&#x8FD0;&#x884C;&#x65F6;&#x4EE3;&#x7801;&#x72B6;&#x6001;&#x533A;&#x5206;">&#x6839;&#x636E;&#x8FD0;&#x884C;&#x65F6;&#x4EE3;&#x7801;&#x72B6;&#x6001;&#x533A;&#x5206;</h3>
<h5 id="1&#x52A8;&#x6001;&#x8BED;&#x8A00;&#xFF08;dynamic-programming-language&#xFF09;">1.&#x52A8;&#x6001;&#x8BED;&#x8A00;&#xFF08;Dynamic Programming Language&#xFF09;</h5>
<p>&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x5176;&#x7ED3;&#x6784;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4F8B;&#x5982;&#x65B0;&#x7684;&#x51FD;&#x6570;&#x3001;&#x5BF9;&#x8C61;&#x3001;&#x751A;&#x81F3;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x88AB;&#x5F15;&#x8FDB;&#xFF0C;&#x5DF2;&#x6709;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x88AB;&#x5220;&#x9664;&#x6216;&#x662F;&#x5176;&#x4ED6;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x53D8;&#x5316;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;Objective-C&#x3001;JavaScript&#x3001;PHP&#x3001;Python&#x3001;Erlang&#x3001;Ruby&#x3001;C#&#xFF08;4.0+&#xFF09;&#x3002;</p>
<h5 id="2&#x9759;&#x6001;&#x8BED;&#x8A00;">2.&#x9759;&#x6001;&#x8BED;&#x8A00;</h5>
<p>&#x4E0E;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8FD0;&#x884C;&#x65F6;&#x7ED3;&#x6784;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x8BED;&#x8A00;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;Java&#x3001;C&#x3001;C++&#x3001;Scala&#x3002;</p>
<h5 id="&#x6CE8;&#x610F;&#xFF1A;">&#x6CE8;&#x610F;&#xFF1A;</h5>
<p>&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x53EF;&#x53D1;&#x751F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x671F;&#xFF08;&#x9759;&#x6001;&#x68C0;&#x67E5;&#xFF09;&#x6216;&#x8FD0;&#x884C;&#x65F6;&#x671F;&#xFF08;&#x52A8;&#x6001;&#x68C0;&#x67E5;&#xFF09;&#x3002;
&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF0C;C#&#x3001;Objective-C&#x662F;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#xFF0C;&#x540C;&#x65F6;&#x662F;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x3002;
&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF08;TypeScript&#xFF09;&#x3002;
&#x9759;&#x6001;&#x8BED;&#x8A00;&#x5B8C;&#x5168;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x3002;</p>
<hr>
<h3 id="&#x6839;&#x636E;&#x6570;&#x636E;&#xFF08;&#x53D8;&#x91CF;&#xFF09;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x65F6;&#x673A;&#x533A;&#x5206;">&#x6839;&#x636E;&#x6570;&#x636E;&#xFF08;&#x53D8;&#x91CF;&#xFF09;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x65F6;&#x673A;&#x533A;&#x5206;</h3>
<h5 id="1&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF08;dynamically-typed-language-&#xFF09;">1.&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF08;Dynamically Typed Language &#xFF09;</h5>
<p>&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x53BB;&#x505A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x548C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7ED1;&#x5B9A;&#x7684;&#x8BED;&#x8A00;&#x3002;
&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x7ECF;&#x7531;&#x8FD0;&#x884C;&#x8DEF;&#x5F84;&#x3001;&#x53D8;&#x91CF;&#x88AB;&#x8D4B;&#x4E88;&#x7684;&#x503C;&#xFF0C;&#x901A;&#x8FC7;&#x63A8;&#x65AD;&#x7C7B;&#x578B;&#x673A;&#x5236;&#xFF08;&#x9E2D;&#x5B50;&#x7C7B;&#x578B;&#xFF0C;Duck typing&#xFF09;&#xFF0C;&#x8C03;&#x5EA6;&#x53D8;&#x91CF;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x6807;&#x8BB0;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;Swift&#x3001;PHP&#x3001;Python&#x3001;Ruby&#x3001;Erlang&#x3001;JavaScript&#x3001;Perl&#x3002;</p>
<h5 id="2&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF08;statically-typed-language&#xFF09;">2.&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF08;Statically Typed Language&#xFF09;</h5>
<p>&#x8FD0;&#x884C;&#x524D;&#xFF08;&#x5982;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#xFF09;&#x505A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x8BED;&#x8A00;&#x3002;
&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x8981;&#x660E;&#x786E;&#x53D8;&#x91CF;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x671F;&#x548C;&#x7F16;&#x8BD1;&#x65F6;&#x671F;&#x4E4B;&#x95F4;&#x7684;&#x5904;&#x7406;&#x9636;&#x6BB5;&#x4E0B;&#x91CD;&#x89C6;&#x8FD9;&#x4E9B;&#x533A;&#x522B;&#x7684;&#xFF08;crash&#x5728;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x4E4B;&#x95F4;&#xFF09;&#x3002;
&#x4F46;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x5F3A;&#x5236;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7684;&#x8BED;&#x8A00;&#x540E;&#x95E8;&#xFF08;&#x5BA3;&#x544A;&#x7C7B;&#x578B;&#xFF08;&#x5F3A;&#x5236;&#x8F6C;&#x6362;&#xFF09;&#xFF09;&#x53EF;&#x7528;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;C&#x3001;C++&#x3001;C#&#x3001;Java&#x3001;Objective-C&#x3002;</p>
<h5 id="3&#x4F9D;&#x5B58;&#x7C7B;&#x578B;&#x8BED;&#x8A00;">3.&#x4F9D;&#x5B58;&#x7C7B;&#x578B;&#x8BED;&#x8A00;</h5>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7834;&#x574F;&#x4E86;&#x9636;&#x6BB5;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x800C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x9700;&#x8981;&#x6D4B;&#x8BD5;&#x8FD0;&#x884C;&#x65F6;&#x671F;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7B49;&#x4EF7;&#x6027;&#xFF0C;&#x8BE5;&#x8BED;&#x8A00;&#x5373;&#x4E3A;&#x4F9D;&#x5B58;&#x7C7B;&#x578B;&#x7684;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;Idris&#x3002;</p>
<h5 id="&#x6CE8;&#x610F;&#xFF1A;">&#x6CE8;&#x610F;&#xFF1A;</h5>
<p>&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x7C7B;&#x5173;&#x6CE8;&#x3001;&#x6355;&#x6349;&#x8FD0;&#x884C;&#x65F6;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x7684;&#x8BED;&#x8A00;&#x3002;
&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#x4E0D;&#x90FD;&#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;Swift&#x662F;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#x4F46;&#x662F;&#x5B83;&#x4E5F;&#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x3002;
&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#x4E0D;&#x90FD;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;C#&#x548C;Java&#x662F;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#x4E5F;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x3002;</p>
<hr>
<h3 id="&#x6839;&#x636E;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E25;&#x683C;&#x7A0B;&#x5EA6;&#x533A;&#x5206;">&#x6839;&#x636E;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E25;&#x683C;&#x7A0B;&#x5EA6;&#x533A;&#x5206;</h3>
<h5 id="1&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF1A;">1.&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF1A;</h5>
<p>&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7981;&#x6B62;&#x9519;&#x8BEF;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x7EE7;&#x7EED;&#x53C2;&#x4E0E;&#x8FD0;&#x884C;&#x3002;
&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x88AB;&#x6307;&#x5B9A;&#x4E86;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x7ECF;&#x8FC7;&#x663E;&#x5F0F;&#x8F6C;&#x6362;&#x7C7B;&#x578B;&#xFF08;&#x5BA3;&#x544A;&#x7C7B;&#x578B;&#xFF08;&#x5F3A;&#x5236;&#x8F6C;&#x6362;&#xFF09;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x6C38;&#x8FDC;&#x662F;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x4F60;&#x4E0D;&#x80FD;&#x628A;&#x4E00;&#x4E2A;&#x6574;&#x5F62;&#x53D8;&#x91CF;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x5904;&#x7406;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;Java&#x3001;C#&#x3001;Python&#x3001;Objective-C&#x3001;Ruby&#x3002;</p>
<h5 id="2&#x5F31;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF1A;">2.&#x5F31;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF1A;</h5>
<p>&#x5F31;&#x7C7B;&#x578B;&#x610F;&#x6307;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x7C7B;&#x578B;&#xFF08;&#x6216;&#x76F4;&#x63A5;&#x5BA3;&#x544A;&#x7C7B;&#x578B;&#xFF08;&#x5F3A;&#x5236;&#x8F6C;&#x6362;&#xFF09;&#xFF09;&#x3002;
&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x8D4B;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x82E5;&#x7ED9;&#x6574;&#x578B;&#x53D8;&#x91CF;A&#x8D4B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#xFF0C;&#x90A3;&#x4E48;A&#x5C31;&#x53D8;&#x6210;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x3002;
&#x4EE3;&#x8868;&#x8BED;&#x8A00;&#xFF1A;JavaScript&#x3001;PHP&#x3001;C&#x3001;C++&#xFF08;C&#x548C;C++&#x6709;&#x4E89;&#x8BAE;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x7ED9;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x53D8;&#x91CF;&#x8D4B;&#x6574;&#x5F62;&#x503C;&#xFF0C;&#x53EF;&#x80FD;&#x521D;&#x8877;&#x662F;&#x5F3A;&#x7C7B;&#x578B;&#xFF0C;&#x5F62;&#x6001;&#x4E0A;&#x63A5;&#x8FD1;&#x5F31;&#x7C7B;&#x578B;&#xFF09;&#x3002;
&#x6CE8;&#x610F;&#xFF1A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x662F;&#x4E0D;&#x662F;&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x548C;&#x662F;&#x4E0D;&#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E5F;&#x6CA1;&#x6709;&#x5FC5;&#x7136;&#x8054;&#x7CFB;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"编程语言分类","level":"1.4.1","depth":2,"previous":{"title":"Other","level":"1.4","depth":1,"ref":"","articles":[{"title":"编程语言分类","level":"1.4.1","depth":2,"path":"main/other/language_type.md","ref":"main/other/language_type.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"main/other/language_type.md","mtime":"2019-04-26T10:02:47.347Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-04-28T08:41:25.105Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

